[
  {
    "image": "https://i.ibb.co.com/tPHz1B8k/380700650-10162533193146729-2379134611963304810-n.jpg",
    "title": "Facebook",
    "companyName": "Meta Platforms",
    "id": 1,
    "description": "Facebook stands as the original titan of social media, fundamentally changing how we connect and share in the digital age. At its core, it is a dynamic social utility that helps you build and maintain relationships with friends, family, and colleagues. The News Feed is your personalized window into their worlds, an ever-flowing stream of photo albums, life updates, shared articles, and videos. Beyond passive consumption, Facebook empowers you to narrate your own story through a versatile profile, where you can express yourself via text posts, live video streams, and temporary Stories, creating a rich timeline of your personal journey.The platform extends far beyond individual profiles, fostering vibrant micro-communities through Facebook Groups. These are dedicated spaces where people with shared interests, hobbies, beliefs, or local affiliations can gather to discuss, share knowledge, and offer support. Furthermore, Facebook has evolved into a powerful local utility with features like Marketplace, a peer-to-peer platform for buying and selling goods within your community, and Events, which helps you discover and organize social gatherings, from concerts to local meetups. For businesses and creators, Facebook Pages offer a public-facing presence to engage with an audience, build a brand, and drive growth, making it an indispensable tool in both our personal and professional lives.",
    "size": "80MB",
    "reviews": "1.2M",
    "ratingAvg": 4.2,
    "downloads": "5B",
    "ratings": [
      {"name": "1 star", "count": "200k"},
      {"name": "2 star", "count": "150k"},
      {"name": "3 star", "count": "300k"},
      {"name": "4 star", "count": "400k"},
      {"name": "5 star", "count": "500k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/Vcv0yZMT/images.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "id": 2,
    "description": "nstagram is a global community for visual storytelling, a platform where creativity, culture, and commerce converge through the power of images and videos. It began as a simple photo-sharing app but has blossomed into a multi-faceted ecosystem for creative expression. Your profile grid serves as your personal art gallery, a curated collection of moments that define you. The platform’s true dynamism, however, lies in its diverse content formats. Instagram Stories offer a casual, ephemeral way to share the raw, unpolished moments of your day, which disappear after 24 hours, encouraging authentic, in-the-moment sharing.The introduction of Reels has transformed Instagram into a primary destination for short-form video entertainment, where users can discover and create engaging, viral content set to music and effects, tapping into global trends. Beyond content creation, Instagram is a powerful tool for connection. Direct Messages (DMs) facilitate private conversations, while the Explore page acts as a personalized discovery engine, surfacing content and creators tailored to your interests. For brands and entrepreneurs, it has become an essential marketplace, with features like Instagram Shopping allowing users to seamlessly browse and purchase products directly from the posts and stories they love, making it a complete hub for inspiration, connection, and commerce.",
    "size": "100MB",
    "reviews": "1.5M",
    "ratingAvg": 4.5,
    "downloads": "4B",
    "ratings": [
      {"name": "1 star", "count": "100k"},
      {"name": "2 star", "count": "80k"},
      {"name": "3 star", "count": "150k"},
      {"name": "4 star", "count": "300k"},
      {"name": "5 star", "count": "500k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/VWtkGMrF/download-3.jpg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms",
    "id": 3,
    "description": "WhatsApp has established itself as the world's leading messaging application, built on a foundation of simplicity, reliability, and above all, privacy. Its primary mission is to facilitate intimate and direct communication between individuals and small groups. The cornerstone of this promise is its default end-to-end encryption, which ensures that all your messages, photos, videos, voice notes, documents, and calls are secured, accessible only to you and the person you're communicating with. This commitment to security has made it the trusted choice for billions of users for their most personal conversations.Its functionality is elegantly straightforward yet incredibly robust. Users can engage in seamless one-on-one chats or create group conversations to coordinate with family, plan projects with colleagues, or simply stay in touch with friends. The app supports a rich variety of media sharing, including high-resolution photos, videos, and documents, making it a versatile tool for both personal and professional use. Features like Status allow for temporary, broadcast-style updates to all your contacts, similar to stories on other platforms. With its clean, ad-free interface and unwavering focus on private communication, WhatsApp serves as an essential utility for daily connection across the globe.",
    "size": "120MB",
    "reviews": "1.1M",
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      {"name": "1 star", "count": "50k"},
      {"name": "2 star", "count": "40k"},
      {"name": "3 star", "count": "100k"},
      {"name": "4 star", "count": "300k"},
      {"name": "5 star", "count": "600k"}
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/733/733579.png",
    "title": "Twitter",
    "companyName": "Twitter Inc.",
    "id": 4,
    "description": "Now rebranded as X, this platform operates as the world's real-time public square, a pulsating hub of live information, breaking news, and global conversation. Its defining characteristic is speed; it's where events unfold and opinions are formed moment-by-moment. The core of the experience is the timeline, a live feed of short-form posts (formerly tweets) from accounts you follow, encompassing everything from official announcements by world leaders to expert commentary on niche topics and viral cultural memes. The platform's brevity forces concise communication, making information easy to digest quickly.X is more than a broadcast medium; it is fundamentally interactive. Users can join conversations by replying, reposting (retweeting), and liking content, contributing their voice to global discussions. Trending topics reveal what the world is talking about at any given moment, offering a real-time snapshot of public consciousness. Features like Spaces provide a venue for live audio conversations, allowing for deeper, more nuanced discussions among communities. For journalists, activists, academics, and public figures, X is an indispensable tool for disseminating information and engaging directly with their audience, solidifying its role as the epicenter of immediate public discourse.",
    "size": "90MB",
    "reviews": "1M",
    "ratingAvg": 4.3,
    "downloads": "2B",
    "ratings": [
      {"name": "1 star", "count": "70k"},
      {"name": "2 star", "count": "60k"},
      {"name": "3 star", "count": "150k"},
      {"name": "4 star", "count": "200k"},
      {"name": "5 star", "count": "500k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/1GCGJ9tQ/download-2.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5,
    "description": "SSnapchat pioneered the concept of ephemeral messaging, creating a platform that mirrors the transient nature of real-life conversations. Its philosophy is centered on fast, fun, and pressure-free communication, encouraging users to share authentic moments without the burden of creating a permanent public record. The core feature is the Snap—a photo or video that you send to a friend, which can be viewed for a limited time before it disappears forever. This fleeting nature fosters a sense of immediacy and intimacy that is unique to the platform.Snapchat is a powerhouse of augmented reality (AR) innovation. Its ever-expanding library of Lenses and Filters allows users to transform their appearance, superimpose digital objects onto the real world, and create playful, interactive content. Beyond one-to-one Snaps, Stories allow users to broadcast a narrative of their day to all their friends, which also disappears after 24 hours. The Snap Map offers a social way to see where your friends are and what they're up to (with privacy controls), while the Discover section features curated content from major publishers and creators, making Snapchat a comprehensive ecosystem for visual communication, creativity, and entertainment.",
    "size": "110MB",
    "reviews": "1.3M",
    "ratingAvg": 4.4,
    "downloads": "3B",
    "ratings": [
      {"name": "1 star", "count": "60k"},
      {"name": "2 star", "count": "50k"},
      {"name": "3 star", "count": "120k"},
      {"name": "4 star", "count": "250k"},
      {"name": "5 star", "count": "500k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/WS8NpPp/download-9.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 6,
    "description": "TikTok has exploded onto the scene as a cultural phenomenon and the definitive hub for short-form mobile video. It is a platform built on a foundation of creativity, joy, and discovery, powered by an exceptionally sophisticated recommendation algorithm. The For You page is the app's centerpiece, an endless, personalized feed of videos that learns your preferences with remarkable accuracy, ensuring that you are constantly served fresh, engaging content tailored to your tastes. This makes the platform incredibly addictive and effective at surfacing new trends, creators, and sounds.The app democratizes content creation with a suite of powerful yet intuitive editing tools, an extensive library of popular music and sounds, and a vast collection of filters and AR effects. This accessibility empowers anyone to become a creator, leading to an incredible diversity of content, from intricate dance challenges and comedic skits to quick DIY tutorials, educational snippets, and heartfelt personal stories. TikTok is not just an app; it is a global cultural engine that shapes music charts, launches careers, and defines modern trends, making it one of the most influential platforms of our time.",
    "size": "130MB",
    "reviews": "1.4M",
    "ratingAvg": 4.7,
    "downloads": "4B",
    "ratings": [
      {"name": "1 star", "count": "40k"},
      {"name": "2 star", "count": "30k"},
      {"name": "3 star", "count": "100k"},
      {"name": "4 star", "count": "300k"},
      {"name": "5 star", "count": "1M"}
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/1384/1384060.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 7,
    "description": "YouTube is the undisputed global leader in online video, functioning as a vast, decentralized library of human knowledge, creativity, and culture. It is a platform of incredible breadth, hosting everything from professionally produced music videos and feature-length films to user-generated vlogs, educational lectures, historical archives, and live news streams. For viewers, it is an infinite resource for entertainment, learning, and skill development. The platform’s powerful recommendation algorithm helps users navigate this immense library, suggesting videos based on their viewing history and subscriptions, creating a personalized and engaging experience.For creators, YouTube has fostered an entire economy, providing a platform where individuals can build a global audience and turn their passion into a career. Through the YouTube Partner Program, creators can monetize their content via advertising revenue, channel memberships, merchandise sales, and direct fan funding. The community aspect is also central to the experience, with comment sections, live chats, and community posts enabling direct interaction between creators and their audience. With the addition of YouTube Shorts for short-form content and YouTube Music for audio streaming, it has solidified its position as an all-encompassing media ecosystem.",
    "size": "150MB",
    "reviews": "1.6M",
    "ratingAvg": 4.8,
    "downloads": "10B",
    "ratings": [
      {"name": "1 star", "count": "30k"},
      {"name": "2 star", "count": "20k"},
      {"name": "3 star", "count": "50k"},
      {"name": "4 star", "count": "200k"},
      {"name": "5 star", "count": "1M"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/k2365P7w/download-10.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 8,
    "description": "Spotify has fundamentally revolutionized how the world listens to music and audio content, offering a seemingly infinite library of songs, podcasts, and audiobooks at your fingertips. At its heart, it provides on-demand streaming of over 100 million tracks, giving users unprecedented access to music from every genre, era, and corner of the globe. However, its true strength lies in its mastery of personalization and discovery. The platform’s algorithms analyze your listening habits to power features like Discover Weekly and Release Radar, which deliver custom-curated playlists of new music you’re likely to love, making music discovery effortless and exciting.Beyond algorithmic recommendations, Spotify excels at human curation, with a vast collection of playlists created by editorial experts and users alike, designed to perfectly match any mood, activity, or event. In recent years, it has heavily invested in becoming the leading platform for podcasts, hosting a massive catalog of shows on every conceivable topic. This expansion has transformed Spotify from a simple music streaming service into a comprehensive audio destination, providing the soundtrack and spoken-word content for every moment of your day.",
    "size": "140MB",
    "reviews": "1.25M",
    "ratingAvg": 4.6,
    "downloads": "3B",
    "ratings": [
      {"name": "1 star", "count": "50k"},
      {"name": "2 star", "count": "40k"},
      {"name": "3 star", "count": "100k"},
      {"name": "4 star", "count": "300k"},
      {"name": "5 star", "count": "800k"}
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/145/145802.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 9,
    "description": "Netflix is the global pioneer and dominant force in subscription-based streaming entertainment, fundamentally altering the way we consume movies and television shows. It provides its members with a vast, on-demand library of content, including licensed films, classic TV series, and, most importantly, its own critically acclaimed original productions (Netflix Originals). This content can be accessed instantly on virtually any internet-connected device, from smart TVs and game consoles to tablets and smartphones, offering unparalleled convenience and flexibility.The platform's user experience is defined by its powerful recommendation engine, which analyzes your viewing habits to suggest titles you are likely to enjoy, creating a highly personalized and engaging interface. A key innovation was its binge-watching release model, where all episodes of a new season are dropped at once, empowering viewers to watch at their own pace. With features like multiple user profiles, parental controls, and the ability to download content for offline viewing, Netflix has created a robust and user-centric service that has become synonymous with modern home entertainment.",
    "size": "160MB",
    "reviews": "1.1M",
    "ratingAvg": 4.5,
    "downloads": "2B",
    "ratings": [
      {"name": "1 star", "count": "40k"},
      {"name": "2 star", "count": "30k"},
      {"name": "3 star", "count": "80k"},
      {"name": "4 star", "count": "300k"},
      {"name": "5 star", "count": "800k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/chPb1M13/download-2.png",
    "title": "Amazon",
    "companyName": "Amazon.com",
    "id": 10,
    "description": "The Amazon app is the mobile gateway to the world's largest and most comprehensive online retailer, transforming your smartphone into a powerful shopping tool. It provides access to an unparalleled selection of millions of products across virtually every category imaginable, from electronics, books, and fashion to groceries, furniture, and automotive parts. The app is designed for maximum convenience, allowing users to quickly search for items, read detailed product descriptions, scan customer reviews, and compare prices from various sellers.Amazon's ecosystem is built around a seamless and efficient customer experience. Prime members enjoy benefits like expedited free shipping, access to the Prime Video streaming service, and exclusive deals. The app integrates advanced features like voice search with Alexa, AR-powered View in Your Room for furniture shopping, and barcode scanning for in-store price comparisons. From one-click ordering and easy returns to real-time package tracking, the Amazon app consolidates the entire shopping journey into a single, powerful interface, making it an indispensable tool for modern commerce.",
    "size": "170MB",
    "reviews": "1.15M",
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      {"name": "1 star", "count": "60k"},
      {"name": "2 star", "count": "50k"},
      {"name": "3 star", "count": "100k"},
      {"name": "4 star", "count": "400k"},
      {"name": "5 star", "count": "800k"}
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/888/888879.png",
    "title": "Uber",
    "companyName": "Uber revolutionized urban transportation by creating a seamless, on-demand platform that connects riders with nearby drivers through a simple mobile app. It addresses the core need for convenient, reliable, and safe transportation at the tap of a button. The user experience is designed to be frictionless: you enter your destination, see an upfront price estimate, request a ride, and are matched with a driver within minutes. You can track your driver's arrival in real-time on a map, share your trip status with loved ones for safety, and handle payment digitally without the need for cash.The platform has expanded its offerings far beyond the standard UberX ride. It now includes options like Uber Comfort for newer cars with more legroom, Uber Green for electric vehicle rides, and Uber Eats, which applies the same on-demand model to food delivery from local restaurants. The built-in rating system for both riders and drivers helps maintain a high standard of quality and accountability within the community. By leveraging technology to solve a fundamental urban challenge, Uber has become a global verb for on-demand mobility.",
    "id": 11,
    "description": "Ride-hailing service for quick transportation.",
    "size": "180MB",
    "reviews": "1.2M",
    "ratingAvg": 4.3,
    "downloads": "3B",
    "ratings": [
      {"name": "1 star", "count": "70k"},
      {"name": "2 star", "count": "60k"},
      {"name": "3 star", "count": "150k"},
      {"name": "4 star", "count": "400k"},
      {"name": "5 star", "count": "800k"}
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/145/145805.png",
    "title": "Airbnb",
    "companyName": "Airbnb fundamentally disrupted the travel and hospitality industry by creating a trusted online marketplace where people can list, discover, and book unique accommodations around the world. Instead of traditional hotels, Airbnb empowers local homeowners (hosts) to rent out their spare rooms, apartments, or entire properties to travelers. This offers guests a more authentic and often more affordable way to experience a destination, allowing them to live like a local rather than just visit as a tourist. The range of listings is vast, from budget-friendly rooms and city-center apartments to extraordinary properties like treehouses, castles, and houseboats.Beyond just a place to stay, Airbnb has expanded to include Experiences, which are unique activities curated and led by local experts. These can range from cooking classes and guided historical tours to outdoor adventures and artistic workshops, providing travelers with immersive ways to engage with the local culture. The platform is built on trust, with a robust system of verified profiles, secure messaging, and a two-way review system where both hosts and guests can rate their experience. This has created a global community that has redefined what it means to travel.",
    "id": 12,
    "description": "Book unique homes and experiences.",
    "size": "190MB",
    "reviews": "1.3M",
    "ratingAvg": 4.6,
    "downloads": "2B",
    "ratings": [
      {"name": "1 star", "count": "50k"},
      {"name": "2 star", "count": "40k"},
      {"name": "3 star", "count": "100k"},
      {"name": "4 star", "count": "300k"},
      {"name": "5 star", "count": "900k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/DgrqzBGm/download-3.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Google Maps has evolved far beyond a simple digital map to become an indispensable and intelligent guide to the physical world. Its core function is providing best-in-class navigation, offering real-time, turn-by-turn directions for driving, walking, cycling, and public transit. It dynamically accounts for live traffic conditions, accidents, and road closures to suggest the fastest and most efficient route, saving users time and reducing travel stress. The platform's accuracy is enhanced by a wealth of data, including satellite imagery and the highly detailed, ground-level photography of Street View.However, its utility extends much deeper than navigation. Google Maps is a powerful local search and discovery engine. You can search for virtually any type of business or point of interest—from restaurants and ATMs to parks and hospitals—and instantly see their location, hours, contact information, photos, and crowd-sourced reviews. Features like Live View use augmented reality to overlay walking directions onto your real-world view, while its integration with ride-sharing services and transit schedules makes it a comprehensive urban mobility hub. It is an essential tool for exploring new places and navigating daily life.",
    "size": "160MB",
    "reviews": "1M",
    "ratingAvg": 4.7,
    "downloads": "5B",
    "ratings": [
      {"name": "1 star", "count": "30k"},
      {"name": "2 star", "count": "20k"},
      {"name": "3 star", "count": "50k"},
      {"name": "4 star", "count": "200k"},
      {"name": "5 star", "count": "950k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/zhr2fjDx/1610338905783.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Gmail is Google's flagship email service, a powerful communication platform that combines a simple, intuitive interface with robust, intelligent features. It redefined user expectations for webmail by offering a massive amount of free storage, effectively eliminating the need for users to constantly delete messages. Its core strength lies in its powerful search functionality, allowing you to instantly find any email, attachment, or conversation, no matter how old. Gmail automatically organizes your inbox into categories like Primary, Social, and Promotions, helping you focus on the messages that matter most.The service is deeply integrated with the broader Google Workspace ecosystem. You can save attachments directly to Google Drive, create calendar events from email content, and launch a Google Meet video call right from your inbox. Security is paramount, with industry-leading protection against spam, phishing attempts, and malware. Smart features like Nudge, which reminds you to follow up on old emails, and Smart Compose, which suggests sentence completions as you type, streamline your workflow and make managing your digital communication faster and more efficient.",
    "size": "150MB",
    "reviews": "900k",
    "ratingAvg": 4.5,
    "downloads": "4B",
    "ratings": [
      {"name": "1 star", "count": "20k"},
      {"name": "2 star", "count": "15k"},
      {"name": "3 star", "count": "50k"},
      {"name": "4 star", "count": "200k"},
      {"name": "5 star", "count": "800k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/1YQ6zvxt/download.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 15,
    "description": "Google Drive is a versatile and powerful cloud storage and file synchronization service that acts as a central hub for all your digital files. It provides a secure place online to store your documents, photos, videos, and any other type of file, making them accessible from any device with an internet connection—be it your computer, tablet, or smartphone. This eliminates the dependency on physical storage devices and ensures that your important files are safely backed up in the cloud.Drive's true power is unlocked through its seamless integration with Google Workspace applications like Docs, Sheets, and Slides. This allows you to create and collaborate on documents, spreadsheets, and presentations in real-time with colleagues or friends, with all changes saved automatically. Its robust sharing features give you granular control over who can view, comment on, or edit your files, making it an essential tool for teamwork and project management. With a generous free storage tier and affordable upgrade options, Google Drive is an indispensable utility for both personal organization and professional collaboration.",
    "size": "160MB",
    "reviews": "850k",
    "ratingAvg": 4.6,
    "downloads": "3.5B",
    "ratings": [
      {"name": "1 star", "count": "20k"},
      {"name": "2 star", "count": "15k"},
      {"name": "3 star", "count": "40k"},
      {"name": "4 star", "count": "150k"},
      {"name": "5 star", "count": "800k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/JbTPx7H/download-4.png",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "id": 16,
    "description": "LinkedIn is the world's premier social network for professionals, operating as an essential platform for career development, professional networking, and industry-specific knowledge sharing. Your LinkedIn profile serves as your dynamic, digital resume—a comprehensive showcase of your work experience, skills, educational background, and professional accomplishments, which can be endorsed and recommended by your connections. It is the first place recruiters and hiring managers look to find and vet potential candidates, making a well-maintained profile crucial for career advancement.The platform is designed to facilitate meaningful professional connections. You can connect with colleagues, industry peers, and thought leaders, expanding your professional circle and unlocking new opportunities. The job search functionality is incredibly powerful, allowing you to find and apply for roles with tailored recommendations based on your profile and interests. Furthermore, LinkedIn has become a major content hub where professionals share industry insights, publish articles, and discuss emerging trends, making its feed a valuable resource for staying informed and engaging in professional discourse. Services like LinkedIn Learning also offer a vast library of online courses to help you acquire new skills.",
    "size": "120MB",
    "reviews": "700k",
    "ratingAvg": 4.4,
    "downloads": "2B",
    "ratings": [
      {"name": "1 star", "count": "15k"},
      {"name": "2 star", "count": "12k"},
      {"name": "3 star", "count": "30k"},
      {"name": "4 star", "count": "150k"},
      {"name": "5 star", "count": "700k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/V06BNS5L/download-5.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 17,
    "description": "Pinterest is a unique visual discovery engine designed for finding inspiration and organizing ideas. It functions like a digital scrapbook or mood board, where users can discover, save, and share visual content (known as Pins) related to their interests and projects. Unlike other social media platforms that are focused on personal updates and social interaction, Pinterest is future-oriented, helping users plan for upcoming events, projects, and purchases, whether it's designing a home, planning a wedding, finding a new recipe, or exploring fashion trends.The user experience is centered around visual browsing. You can explore a home feed of Pins tailored to your interests or search for specific ideas. When you find something you like, you can save it to one of your themed Boards,creating curated collections of inspiration. This visual-first approach makes it an incredibly powerful tool for gathering ideas and visualizing goals. For creators and businesses, it's also a valuable platform to visually market products and drive traffic, as every Pin can link back to an external website.",
    "size": "110MB",
    "reviews": "600k",
    "ratingAvg": 4.3,
    "downloads": "1.5B",
    "ratings": [
      {"name": "1 star", "count": "10k"},
      {"name": "2 star", "count": "8k"},
      {"name": "3 star", "count": "20k"},
      {"name": "4 star", "count": "120k"},
      {"name": "5 star", "count": "500k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/TxbWvNs3/download-8.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 18,
    "description": "Reddit bills itself as the front page of the internet,and it is a vast network of communities built around shared interests, hobbies, and passions. The platform is organized into thousands of user-created forums known as subreddits each dedicated to a specific topic. These topics can be incredibly broad (like r/news or r/funny) or extraordinarily niche (like r/MechanicalKeyboards or r/birdswitharms). This structure allows users to dive deep into any subject imaginable and connect with a global community of like-minded individuals.Content on Reddit is driven by its users, who can submit posts in the form of links, text, images, or videos. The community then determines the visibility of this content through a voting system of upvotes and downvotes. The most popular and engaging posts rise to the top, creating a constantly evolving, crowd-curated feed of information and entertainment. The comment sections are often where the real magic happens, with users engaging in detailed discussions, humorous exchanges, and knowledgeable debates. This user-driven, community-focused model makes Reddit a truly unique and authentic corner of the internet.",
    "size": "130MB",
    "reviews": "500k",
    "ratingAvg": 4.2,
    "downloads": "1B",
    "ratings": [
      {"name": "1 star", "count": "12k"},
      {"name": "2 star", "count": "10k"},
      {"name": "3 star", "count": "25k"},
      {"name": "4 star", "count": "100k"},
      {"name": "5 star", "count": "400k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/kgPfHfJJ/download.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 19,
    "description": "Zoom has become a household name and an essential tool for modern communication, providing a reliable and feature-rich platform for video conferencing, online meetings, and virtual events. It rose to prominence due to its exceptional stability, high-quality video and audio, and an intuitive user interface that makes it easy for anyone to join or host a meeting. Zoom effectively bridges physical distances, enabling seamless real-time collaboration for remote teams, effective online instruction for educational institutions, and personal connections for friends and family.The platform is packed with features designed to enhance productivity and engagement. Screen sharing allows participants to present documents and applications, while virtual backgrounds add a layer of privacy and fun. Breakout rooms facilitate smaller group discussions within a larger meeting, and the chat function allows for parallel text-based conversations. With the ability to record meetings for later viewing and host large-scale webinars for hundreds of attendees, Zoom has proven to be a versatile and indispensable solution for nearly any form of remote interaction in both professional and personal contexts.",
    "size": "140MB",
    "reviews": "400k",
    "ratingAvg": 4.5,
    "downloads": "2B",
    "ratings": [
      {"name": "1 star", "count": "10k"},
      {"name": "2 star", "count": "8k"},
      {"name": "3 star", "count": "20k"},
      {"name": "4 star", "count": "80k"},
      {"name": "5 star", "count": "300k"}
    ]
  },
  {
    "image": "https://i.ibb.co.com/TBfwhYT6/download-7.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 20,
    "description": "Slack is a powerful, channel-based messaging platform designed to streamline communication and collaboration for teams and businesses. It aims to replace the chaos of internal email with a more organized, efficient, and searchable system. All communication in Slack is organized into channels, which can be created for specific projects, departments, or topics. This structure ensures that conversations are focused and relevant, and that all team members have visibility into the discussions and files related to their work.The platform supports real-time messaging, file sharing, and one-on-one or group voice and video calls. Its true strength, however, lies in its deep integration capabilities. Slack connects with thousands of other workplace tools and services—such as Google Drive, Asana, and GitHub—allowing notifications and actions from those apps to flow directly into your Slack channels. This turns Slack into a central command center for all your team's work, reducing context-switching and improving overall productivity. By centralizing communication and workflows, Slack helps teams stay aligned and move faster.",
    "size": "120MB",
    "reviews": "350k",
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      {"name": "1 star", "count": "8k"},
      {"name": "2 star", "count": "7k"},
      {"name": "3 star", "count": "15k"},
      {"name": "4 star", "count": "70k"},
      {"name": "5 star", "count": "250k"}
    ]
  }
]
